# Notebook 2

Ejercicio 1.  ¿De qué podría servir esta base de datos? ¿Cuál era su aplicación probable? 
              ¿Cuál sería una adaptación posible más moderna?

Podría servir para una tienda de alquiler de videos, como antiguamente lo era blockbuster.
La aplicación de la bd era buscar películas mediante sus características para el posterior arriendo de esta.
Una adaptación moderna: podría ser utilizarla para Netflix.

In [2]:
import mysql.connector
import pandas as pd
from IPython.display import display,HTML

db_connection = mysql.connector.connect(user="root",host="localhost",password="94209420")
cursor = db_connection.cursor()
cursor.execute("USE sakila")

1) A partir de la tabla "film", mostrar solamente cuáles son los títulos de pelicula disponibles.

In [3]:
df = pd.read_sql('SELECT title FROM film LIMIT 10;', con=db_connection)
display(df)

              title
0  ACADEMY DINOSAUR
1    ACE GOLDFINGER
2  ADAPTATION HOLES
3  AFFAIR PREJUDICE
4       AFRICAN EGG
5      AGENT TRUMAN
6   AIRPLANE SIERRA
7   AIRPORT POLLOCK
8     ALABAMA DEVIL
9  ALADDIN CALENDAR

2) A partir de la tabla "film", mostrar de qué años son las peliculas disponibles. NB: utilizar la instrucción DISTINCT

In [4]:
df = pd.read_sql('SELECT DISTINCT release_year FROM film LIMIT 5;', con=db_connection)
display(df)

   release_year
0          2006

3) Mostrar los títulos de pelicula en la tabla "film" que se puede arrendar por más de 4 días (rental_duration)

In [5]:
df = pd.read_sql('SELECT title, rental_duration '+'FROM film '+'WHERE rental_duration >= 4 LIMIT 5;', con=db_connection)
display(df)

              title  rental_duration
0  ACADEMY DINOSAUR                6
1  ADAPTATION HOLES                7
2  AFFAIR PREJUDICE                5
3       AFRICAN EGG                6
4   AIRPLANE SIERRA                6

4) En la tabla "payment", mostrar el customer_id, rental_id, amount y payment_date de todos los arriendos realizados entre las fechas 2005-07-01 y 2005-08-01

In [6]:
df = pd.read_sql('SELECT customer_id, rental_id, amount, payment_date ' + 'FROM payment '+ 'WHERE payment_date BETWEEN \"2005-07-01\" AND \"2005-08-01\" LIMIT 5;', con=db_connection)
display(df)

   customer_id  rental_id  amount        payment_date
0            1       4526    5.99 2005-07-08 03:17:05
1            1       4611    5.99 2005-07-08 07:33:56
2            1       5244    4.99 2005-07-09 13:24:07
3            1       5326    4.99 2005-07-09 16:38:01
4            1       6163    7.99 2005-07-11 10:13:46

Ejercicio 4

1) Contar el número de clientes en la tabla "CUSTOMER"

In [7]:
df = pd.read_sql('SELECT count(*) FROM customer;', con=db_connection)
display(df)

   count(*)
0       599

2) En la tabla "RENTAL", contar cuánto arriendos se realizó por cada cliente (NB: utilizar la instucción GROUP BY y COUNT)

In [8]:
df = pd.read_sql('SELECT COUNT(rental_id), customer_id FROM rental GROUP BY customer_id LIMIT 10;', con=db_connection)
display(df)

   COUNT(rental_id)  customer_id
0                32            1
1                27            2
2                26            3
3                22            4
4                38            5
5                28            6
6                33            7
7                24            8
8                23            9
9                25           10

3) ¿Qué devuelve la consulta SQL siguiente?

SELECT MAX(total) FROM (SELECT customer_id,count(*) as total FROM rental GROUP BY customer_id) as t1;

Es una subconsulta. Primero agrupa los clientes con su cantidad de rentas respectivas. 
Luego selecciona el valor máximo de rentas que se han realizado por un cliente.

In [56]:
df = pd.read_sql('SELECT MAX(total) FROM (SELECT customer_id, count(*) as total FROM rental GROUP BY customer_id) as t1;', con=db_connection)
display(df)

   MAX(total)
0          46

4) ¿Qué es un sub-consulta?

Es una consulta anidada dentro de otra consulta.

5) En la tabla "payment", mostrar el volumen de negocio realizado por cada miembro del staff (staff_id) en total.

In [145]:
df = pd.read_sql('SELECT staff_id, SUM(amount) FROM payment GROUP BY staff_id;', con=db_connection)
display(df)

   staff_id  SUM(amount)
0         1     33489.47
1         2     33927.04

6) En una consulta, mostrar el staff_id que ha realizado más volumen de negocio el dia 2005-08-23.

In [244]:
df = pd.read_sql('SELECT staff_id, SUM(amount) as total FROM payment WHERE payment_date LIKE "2005-08-23%" GROUP BY staff_id;', con=db_connection)
display(df)

   staff_id    total
0         1  1391.69
1         2  1131.32

Ejercicio 5

1) En las peliculas "Film" y "Language", mostrar el título de la pelicula y el nombre de su idioma. (NB: utilizar una operación de INNER JOIN)

In [271]:
df = pd.read_sql('SELECT title, name FROM film INNER JOIN language ON film.language_id = language.language_id LIMIT 10;', con=db_connection)
display(df)

              title     name
0  ACADEMY DINOSAUR  English
1    ACE GOLDFINGER  English
2  ADAPTATION HOLES  English
3  AFFAIR PREJUDICE  English
4       AFRICAN EGG  English
5      AGENT TRUMAN  English
6   AIRPLANE SIERRA  English
7   AIRPORT POLLOCK  English
8     ALABAMA DEVIL  English
9  ALADDIN CALENDAR  English

2) Mostrar los nombres y apellidos de los clientes que han arrendado la pelicula "CHICAGO NORTH"

In [315]:
df = pd.read_sql('SELECT first_name, last_name FROM customer INNER JOIN rental ON customer.customer_id = rental.customer_id' 
                 + ' INNER JOIN inventory ON rental.inventory_id = inventory.inventory_id'
                 + ' INNER JOIN film ON inventory.inventory_id = film.film_id'
                 + ' WHERE title = "CHICAGO NORTH"', con=db_connection)
display(df)

  first_name last_name
0   THEODORE      CULP
1      ALVIN   DELOACH
2     HAROLD   MARTINO
3       DANA      HART
4     DEBBIE     REYES

3) Mostrar por cada nombres y apellidos de cliente, en qué ciudad viven (tabla Customer y City)

In [336]:
df = pd.read_sql('SELECT first_name, last_name, city, customer_id FROM customer INNER JOIN address'
                 +' ON customer.address_id = address.address_id'
                 +' INNER JOIN city ON address.city_id = address.city_id;', con=db_connection)
display(df)

       first_name  last_name                city  customer_id
0            MARY      SMITH  A Corua (La Corua)            1
1        PATRICIA    JOHNSON  A Corua (La Corua)            2
2           LINDA   WILLIAMS  A Corua (La Corua)            3
3         BARBARA      JONES  A Corua (La Corua)            4
4       ELIZABETH      BROWN  A Corua (La Corua)            5
5        JENNIFER      DAVIS  A Corua (La Corua)            6
6           MARIA     MILLER  A Corua (La Corua)            7
7           SUSAN     WILSON  A Corua (La Corua)            8
8        MARGARET      MOORE  A Corua (La Corua)            9
9         DOROTHY     TAYLOR  A Corua (La Corua)           10
10           LISA   ANDERSON  A Corua (La Corua)           11
11          NANCY     THOMAS  A Corua (La Corua)           12
12          KAREN    JACKSON  A Corua (La Corua)           13
13          BETTY      WHITE  A Corua (La Corua)           14
14          HELEN     HARRIS  A Corua (La Corua)           15
15         SANDRA     MARTIN  A Corua (La Corua)           16
16          DONNA   THOMPSON  A Corua (La Corua)           17
17          CAROL     GARCIA  A Corua (La Corua)           18
18           RUTH   MARTINEZ  A Corua (La Corua)           19
19         SHARON   ROBINSON  A Corua (La Corua)           20
20       MICHELLE      CLARK  A Corua (La Corua)           21
21          LAURA  RODRIGUEZ  A Corua (La Corua)           22
22          SARAH      LEWIS  A Corua (La Corua)           23
23       KIMBERLY        LEE  A Corua (La Corua)           24
24        DEBORAH     WALKER  A Corua (La Corua)           25
25        JESSICA       HALL  A Corua (La Corua)           26
26        SHIRLEY      ALLEN  A Corua (La Corua)           27
27        CYNTHIA      YOUNG  A Corua (La Corua)           28
28         ANGELA  HERNANDEZ  A Corua (La Corua)           29
29        MELISSA       KING  A Corua (La Corua)           30
...           ...        ...                 ...          ...
359370       IVAN   CROMWELL          Ziguinchor          570
359371    JOHNNIE   CHISHOLM          Ziguinchor          571
359372     SIDNEY   BURLESON          Ziguinchor          572
359373      BYRON        BOX          Ziguinchor          573
359374     JULIAN       VEST          Ziguinchor          574
359375      ISAAC    OGLESBY          Ziguinchor          575
359376     MORRIS   MCCARTER          Ziguinchor          576
359377    CLIFTON    MALCOLM          Ziguinchor          577
359378    WILLARD    LUMPKIN          Ziguinchor          578
359379      DARYL      LARUE          Ziguinchor          579
359380       ROSS       GREY          Ziguinchor          580
359381     VIRGIL    WOFFORD          Ziguinchor          581
359382       ANDY    VANHORN          Ziguinchor          582
359383   MARSHALL      THORN          Ziguinchor          583
359384   SALVADOR       TEEL          Ziguinchor          584
359385      PERRY   SWAFFORD          Ziguinchor          585
359386       KIRK    STCLAIR          Ziguinchor          586
359387     SERGIO  STANFIELD          Ziguinchor          587
359388     MARION     OCAMPO          Ziguinchor          588
359389      TRACY   HERRMANN          Ziguinchor          589
359390       SETH     HANNON          Ziguinchor          590
359391       KENT  ARSENAULT          Ziguinchor          591
359392   TERRANCE      ROUSH          Ziguinchor          592
359393       RENE  MCALISTER          Ziguinchor          593
359394    EDUARDO      HIATT          Ziguinchor          594
359395   TERRENCE  GUNDERSON          Ziguinchor          595
359396    ENRIQUE   FORSYTHE          Ziguinchor          596
359397    FREDDIE     DUGGAN          Ziguinchor          597
359398       WADE   DELVALLE          Ziguinchor          598
359399     AUSTIN    CINTRON          Ziguinchor          599

[359400 rows x 4 columns]

In [326]:
df = pd.read_sql('SELECT count(*) FROM customer;', con=db_connection)
display(df)

   count(*)
0       599